app/controllers/api/cards_controller.rb

INSERT INTO "cards" ("term", "definition", "deck_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["term", ""], ["definition", ""], ["deck_id", 20], ["created_at", "2020-08-02 13:36:02.794365"], ["updated_at", "2020-08-02 13:36:02.794365"]]
---
    def create
        @card = Card.new(deck_id: params[:set][:id], term: '', definition: '')
        if @card.save!

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
    def show
        @card = Card.find_by(id: params[:id])

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 135], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 135]]
---
    def destroy
        @card = Card.find_by(id: params[:id])
        @card.destroy

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 183], ["LIMIT", 1]]
UPDATE "cards" SET "term" = $1, "definition" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["term", "hello"], ["definition", "world"], ["updated_at", "2020-08-02 14:34:36.582758"], ["id", 183]]
---
    def update
        @card = Card.find_by(id: params[:id])
        if @card.update!(term: params[:card][:term], definition: params[:card][:definition])