app/controllers/api/decks_controller.rb

INSERT INTO "decks" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["description", ""], ["user_id", 5], ["created_at", "2020-08-02 01:25:30.915283"], ["updated_at", "2020-08-02 01:25:30.915283"]]
INSERT INTO "decks" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-08-01 02:32:47.615088"], ["updated_at", "2020-08-01 02:32:47.615088"]]
INSERT INTO "cards" ("term", "definition", "deck_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["term", ""], ["definition", ""], ["deck_id", 19], ["created_at", "2020-08-02 01:25:30.944303"], ["updated_at", "2020-08-02 01:25:30.944303"]]
---
    def create
        @deck = Deck.create!(user_id: params[:user][:id], title: '', description: '')
        5.times do
            new_card = Card.create(deck_id: @deck.id, term: '', definition: '')

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34)
SELECT "decks".* FROM "decks" WHERE "decks"."user_id" = $1  [["user_id", 5]]
---
    def index
        @decks = Deck.where(user_id: params[:user][:id]).includes(:cards)

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
        @deck = Deck.find_by(id: params[:id])

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "decks" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "decks"."id" = $4  [["title", "Test"], ["description", ""], ["updated_at", "2020-08-04 02:03:02.835503"], ["id", 8]]
---
    def update
        @deck = Deck.find_by(id: params[:id])
        if @deck.update!(title: params[:set][:title], description: params[:set][:description])

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 67], ["LIMIT", 1]]
DELETE FROM "decks" WHERE "decks"."id" = $1  [["id", 67]]
---
    def destroy
        @deck = Deck.find_by(id: params[:id])
        @deck.destroy