app/controllers/api/decks_controller.rb

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        @deck = Deck.find_by(id: params[:id])