app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "geor"], ["LIMIT", 1]]
---
    def create
        @username = params[:user][:username]
            @user = User.find_by_username(@username)