app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "birthday", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "g.rodnikov@gmail.com"], ["LIMIT", 1]]
---
    def validate_email
        @user = User.find_by(email: params[:email])

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "george"], ["LIMIT", 1]]
---
    def validate_username
        @user = User.find_by(username: params[:username])