app/views/api/decks/index.json.jbuilder

            json.extract! deck, :id, :title, :description, :user_id
            json.set! :card_count, deck.cards.length
---
SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = $1  [["deck_id", 55]]