app/views/api/decks/show.json.jbuilder

json.set! :cards do
    @deck.cards.each do |card|
---
SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = $1  [["deck_id", 3]]