app/views/api/decks/updated.json.jbuilder

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = $1  [["deck_id", 8]]
---
        json.extract! @deck, :id, :title, :description, :user_id
        json.set! :card_count, @deck.cards.length