app/models/user.rb

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "IgLSjQqEIrKjlE0lM7KCrA"], ["updated_at", "2020-07-27 19:58:11.888670"], ["id", 1]]